<?php

return [
    'unexpected_error' => ".حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا",
    'user' => [
        'not_found' => ".المستخدم غير موجود",
        'not_found_index' => ".لم يتم العثور على أي مستخدم",
        'password_already_added' => ".تم إضافة كلمة السر بالفعل",
        'password_current_incorrect' => ".كلمة المرور الحالية غير صحيحة",
        'role_already_assigned' => ".هذا الدور تم تعيينه للمستخدم بالفعل",
    ],

    'notification' => [
        'not_found_unread_notification' => ".لم يتم العثور على هذا الإشعار الغير مقروء",
        'not_found_unread_notifications' => ".لم يتم العثور على إشعارات غير مقروءة",
    ],

    'room_type' => [
        'not_found_index_with_criteria' => ".لم يتم العثور على أنواع غرف تطابق المعايير المحددة",
        'not_found_index_trashed_with_criteria' => ".لم يتم العثور على أنواع غرف محذوفة تطابق المعايير المحددة",
        'not_found_index' => ".لم يتم العثور على أنواع غرف في الوقت الحالي",
        'not_found_index_trashed' =>  ".لم يتم العثور على أنواع غرف محذوفة",
        'not_found_favorite' => ".المفضلة لا تحوي على اي نوع من الغرف",
        'not_found' => ".نوع الغرفة غير موجود",
        'not_found_rooms' => ".لم يتم العثور على غرف تابعة لهذا النوع",
        'not_found_services' => ".لم يتم العثور على خدمات تابعة لهذا النوع",
        'already_favorite' => ".تم إضافة نوع الغرفة إلى المفضلة بالفعل",
        'not_in_favorite' => ".نوع الغرفة ليس ضمن المفضلة",
        'has_rooms' => ".غير قادر على حذف نوع الغرفة قبل حذف جميع غرفها",
        'soft_delete' => ".غير قادر على حذف نوع الغرفة",
        'restore' => ".غير قادر على استعادة نوع الغرفة من الحذف",
        'force_delete' => ".غير قادر على حذف نوع الغرفة بشكل نهائي",
    ],

    'room' => [
        'not_found_index_with_criteria' => ".لم يتم العثور على غرف تطابق المعايير المحددة",
        'not_found_index_trashed_with_criteria' => ".لم يتم العثور على غرف محذوفة تطابق المعايير المحددة",
        'not_found_index' => ".لم يتم العثور على غرف في الوقت الحالي",
        'not_found_index_trashed' =>  ".لم يتم العثور على غرف محذوفة",
        'not_found_favorite' => ".المفضلة لا تحوي على أي غرفة",
        'not_found' => ".الغرفة غير موجودة",
        'not_found_dates' => ".لم يتم العثور على تواريخ غير متاحة لهذه الغرفة",
        'not_found_bookings' => ".لم يتم العثور على حجوزات لهذه الغرفة",
        'already_favorite' => ".تم إضافة الغرفة إلى المفضلة بالفعل",
        'not_in_favorite' => ".الغرفة ليست ضمن المفضلة",
        'can’t_delete_booked' => ".لا يمكن الحذف، هذه الغرفة محجوزة",
        'soft_delete' => ".غير قادر على حذف الغرفة",
        'restore' => ".غير قادر على استعادة الغرفة من الحذف",
        'force_delete' => ".غير قادر على حذف الغرفة بشكل نهائي",
        'unavailable' => ".هذه الغرفة غير متاحة، يمكنك الإطلاع على التواريخ الغير متاحة",
    ],

    'service' => [
        'not_found_index_with_criteria' => ".لم يتم العثور على خدمات تطابق المعايير المحددة",
        'not_found_index_trashed_with_criteria' => ".لم يتم العثور على خدمات محذوفة تطابق المعايير المحددة",
        'not_found_index' => ".لم يتم العثور على خدمات في الوقت الحالي",
        'not_found_index_trashed' =>  ".لم يتم العثور على خدمات محذوفة",
        'not_found_favorite' => ".المفضلة لا تحوي على أي خدمة",
        'not_found' => ".الخدمة غير موجودة",
        'not_found_dates' => ".لم يتم العثور على تواريخ غير متاحة لهذه الخدمة",
        'not_found_room_types' => ".لم يتم العثور على أنواع غرف مرتبطة بهذه الخدمة",
        'not_found_bookings' => ".لم يتم العثور على حجوزات لهذه الخدمة",
        'already_favorite' => ".تم إضافة الخدمة إلى المفضلة بالفعل",
        'not_in_favorite' => ".الخدمة ليست ضمن المفضلة",
        'can’t_delete_booked' => ".لا يمكن الحذف، هذه الخدمة محجوزة",
        'soft_delete' => ".غير قادر على حذف الخدمة",
        'restore' => ".غير قادر على استعادة الخدمة من الحذف",
        'force_delete' => ".غير قادر على حذف الخدمة بشكل نهائي",
        'units' =>  ".هذه الخدمة محدودة ولم يتبقى منها وحدات في الفترة المرسلة، يمكنك الاطلاع على عدد الوحدات المتاحة في هذه الفترة",
        'not_limited' => ".هذه الخدمة غير محدودة",
    ],

    'room_type_service' => [
        'already_assign' => ".تم إسناد الخدمة إالى نوع الغرفة بالفعل",
        'not_assign' => ".هذه الخدمة غير مسندةإلى نوع الغرفة",
    ],

    'booking' => [
        'payment_failed' => ".فشل الدفع، تم إلغاء الحجز",
    ],

    'invoice' => [
        'not_found' => ".الفاتورة غير موجودة",
        'not_pending' => ".حالة الفاتورة ليست قيد الانتظار",
        'not_found_index_with_criteria' => ".لم يتم العثور على فواتير تطابق المعايير المحددة",
        'not_found_index_user' => ".أنت لا تملك أي فاتورة",
        'not_found_index' => ".لم يتم العثور على  فواتير",
    ],
];
