<?php

return [
    'email' => [
        'salutation' => "أطيب التمنيات",
        'greeting' => " مرحبا",
        'Thank_line' => ".شكرا لك على استخدام تطبيقنا",
        'verify_email' => [
            'subject' => "تحقق من بريدك الالكتروني",
            'line1' => "انقر فوق الزر أدناه للتحقق من عنوان بريدك الالكتروني",
            'action' => "أكد بريدك الالكتروني",
        ],
        'invoice_paid' => [
            'user' => [
                'subject' => "تم دفع فاتورتك بنجاح",
                'line1' => " التكلفة الإجمالية",
                'line2' => " يمكنك تلقي الغرفة من",
                'line3' => " حتى",
            ],

            'super_admin' => [
                'subject' => "تم دفع فاتورة جديدة بنجاح",
                'line1' => " تم دفع الفاتورة من قبل ",
                'line2' => " التكلفة الإجمالية",
                'line3' => "  فترة الحجز من",
                'lin4' => "  حتى",
            ],
        ],

    ],

    'database' => [
        'email_updated' => ".تم تحديث بريدك الإلكتروني وتم إلغاء ربط حسابك مع وسائل التواصل الاجتماعي. يرجى تحديث بريدك الإلكتروني في حساباتك لإعادة ربطها",
        'invoice_paid' => [
            'user' => ".تم دفع فاتورتك بنجاح",
            'super_admin' => ".تم دفع فاتورة جديدة بنجاح",
        ],
    ],

];
