<?php

return [
    'user' => [
        'password_add' => ".تم إضافة كلمة السر إالى حسابك بنجاح",
        'password_update' => ".تم تحديث كلمة المرور بنجاح",
        'profile_update_with_email' => ".تم تحديث تفاصيل ملفك الشخصي بنجاح. يُرجى التحقق من بريدك الإلكتروني الجديد لتأكيده. يُنصح أيضًا بتحديث البريد الإلكتروني في حسابات التواصل الاجتماعي المرتبطة",
        'profile_update' => ".تم تحديث تفاصيل ملفك الشخصي بنجاح",
        'show_profile' => ".تم جلب تفاصيل ملفك الشخصي بنجاح",
        'show_user' => ".تم جلب تفاصيل المستخدم بنجاح",
        'index' => ".تم جلب جميع تفاصيل المستخدمين الذين تم التحقق منهم بنجاح",
        'role_assign' => ".تم تعيين الدور إلى المستخدم بنجاح",
    ],

    'notification' => [
        'get_all_notifications' => ".تم جلب كافة الإشعارات بنجاح",
        'get_unread_notifications' => ".تم جلب كافة الإشعارات الغير مقروءة بنجاح",
        'markAsRead' => ".تم قراءة الإشعار بنجاح",
        'markAllAsRead' => ".تم قراءة جميع الإشعارات بنجاح",
    ],

    'room_type' => [
        'index' => ".تم جلب أنواع الغرف بنجاح",
        'index_trashed' => ".تم جلب أنواع الغرف المحذوفة بنجاح",
        'show' => ".تم جلب نوع الغرفة بنجاح",
        'show_trashed' => ".تم جلب نوع الغرفة المحذوفة بنجاح",
        'rooms' => ".تم جلب جميع الغرف التابعة لهذا النوع بنجاح",
        'services' => ".تم جلب جميع الخدمات التابعة لهذا النوع بنجاح",
        'favorite' => ".تم جلب أنواع الغرف المفضلة بنجاح",
        'add_to_favorite' => ".تم إضافة نوع الغرفة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف نوع الغرفة من المفضلة بنجاح",
        'create' => ".تم إنشاء نوع غرفة جديد بنجاح",
        'update' => ".تم تحديث نوع الغرفة بنجاح",
        'soft_delete' => ".تم حذف نوع الغرفة بنجاح",
        'restore' => ".تم استعادة نوع الغرفة المحذوفة من الحذف بنجاح",
        'force_delete' => ".تم حذف نوع الغرفة بشكل نهائي بنجاح",
    ],

    'room' => [
        'index' => ".تم جلب الغرف بنجاح",
        'index_trashed' => ".تم جلب الغرف المحذوفة بنجاح",
        'show' => ".تم جلب الغرفة بنجاح",
        'show_trashed' => ".تم جلب الغرفة المحذوفة بنجاح",
        'bookings' => ".تم جلب جميع الحجوزات لهذه الغرفة بنجاح",
        'favorite' => ".تم جلب الغرف المفضلة بنجاح",
        'unavailable_dates' => ".تم جلب التواريخ الغير متاحة لهذه الغرفة بنجاح",
        'add_to_favorite' => ".تم إضافة الغرفة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف الغرفة من المفضلة بنجاح",
        'create' => ".تم إنشاء غرفة جديدة بنجاح",
        'update' => ".تم تحديث الغرفة بنجاح",
        'soft_delete' => ".تم حذف الغرفة بنجاح",
        'restore' => ".تم استعادة الغرفة المحذوفة من الحذف بنجاح",
        'force_delete' => ".تم حذف الغرفة بشكل نهائي بنجاح",
    ],

    'service' => [
        'index' => ".تم جلب الخدمات بنجاح",
        'index_trashed' => ".تم جلب الخدمات المحذوفة بنجاح",
        'show' => ".تم جلب الخدمة بنجاح",
        'show_trashed' => ".تم جلب الخدمة المحذوفة بنجاح",
        'room_types' => ".تم جلب أنواع الغرف المرتبطة بهذه الخدمة بنجاح",
        'bookings' => ".تم جلب الحجوزات لهذه الخدمة بنجاح",
        'favorite' => ".تم جلب الخدمات المفضلة بنجاح",
        'unavailable_dates' => ".تم جلب التواريخ الغير متاحة لهذه الخدمة بنجاح",
        'limited_units' => ".تم جلب عدد الوحدات المتاحة لهذه الخدمة",
        'add_to_favorite' => ".تم إضافة الخدمة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف الخدمة من المفضلة بنجاح",
        'create' => ".تم إنشاء خدمة جديدة بنجاح",
        'update' => ".تم تحديث الخدمة بنجاح",
        'soft_delete' => ".تم حذف الخدمة بنجاح",
        'restore' => ".تم استعادة الخدمة المحوفة من الحذف بنجاح",
        'force_delete' => ".تم حذف الخدمة بشكل نهائي بنجاح",
    ],

    'room_type_service' => [
        'assign' => ".تم إسناد الخدمة إلى نوع الغرفة بنجاح",
        'revoke' => ".تم إلغاء الخدمة من نوع الغرفة بنجاح",
    ],

    'booking' => [
        'total_cost' => ".تم حساب التكلفة الإجمالية للحجز بنجاح",
        'payment_intent' => ".تم بدأ عملية الدفع بنجاح",
        'payment_confirm' => ".تم تأكيد الدفع بنجاح",
    ],

    'invoice' => [
        'index_user' => ".تم جلب جميع فواتيرك بنجاح",
        'index' => ".تم جلب جميع الفواتير بنجاح",
        'show_user' =>  ".تم جلب فاتورتك بنجاح",
        'show' => ".تم جلب الفاتورة بنجاح",
        'bookings_user' => ".تم جلب جميع الحجوزات التابعة لفاتورتك بنجاح",
        'bookings' => ".تم جلب جميع الحجوزات التابعة لهذه الفاتورة بنجاح",
    ],
];
